{
  "resourceType": "ValueSet",
  "id": "cimi-statement-DiagnosticServiceVS",
  "text": {
    "status": "generated",
    "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">\n<p><b>SHR DiagnosticServiceVS ValueSet</b></p>\n<p>The type of laboratory service used in producing a laboratory result</p>\n</div>"
  },
  "url": "http://standardhealthrecord.org/cimi/statement/vs/DiagnosticServiceVS",
  "identifier": [
    {
      "system": "http://standardhealthrecord.org",
      "value": "cimi.statement.DiagnosticServiceVS"
    }
  ],
  "version": "0.1.0",
  "name": "DiagnosticServiceVS",
  "title": "SHR DiagnosticServiceVS ValueSet",
  "status": "draft",
  "date": "2018-08-22T00:00:00-04:00",
  "publisher": "The MITRE Corporation: Standard Health Record Collaborative",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://standardhealthrecord.org"
        }
      ]
    }
  ],
  "description": "The type of laboratory service used in producing a laboratory result",
  "compose": {
    "include": [
      {
        "system": "http://standardhealthrecord.org/cimi/statement/cs/DiagnosticServiceCS",
        "concept": [
          {
            "code": "microbiology",
            "display": "Laboratory concerned with cultures, to look for suspected pathogens."
          },
          {
            "code": "parasitology",
            "display": "Laboratory responsible for examining parasites, feces samples may be examined for evidence of intestinal parasites such as tapeworms or hookworms and others."
          },
          {
            "code": "virology",
            "display": "Laboratory concerned with identification of viruses in specimens such as blood, urine, and cerebrospinal fluid."
          },
          {
            "code": "hematology",
            "display": "Laboratory that works with whole blood to do full blood counts, and blood films as well as many other specialised tests."
          },
          {
            "code": "biochemistry",
            "display": "Laboratory that usually receives serum or plasma and tests the serum for chemicals present in blood."
          },
          {
            "code": "toxicology",
            "display": "Laboratory that mainly tests for pharmaceutical and recreational drugs. Urine and blood samples are submitted to this lab."
          },
          {
            "code": "immunology",
            "display": "Immunology/Serology laboratory uses the concept of antigen-antibody interaction as a diagnostic tool. Compatibility of transplanted organs is also determined."
          },
          {
            "code": "Immunohaematology",
            "display": "Laboratory or blood bank that determines blood groups, and performs compatibility testing on donor blood and recipients. It also prepares blood components, derivatives, and products for transfusion."
          },
          {
            "code": "urinalysis",
            "display": "Laboratory tests urine for many analytes. Some health care providers have a urinalysis laboratory, while others don't."
          },
          {
            "code": "pathology",
            "display": "Surgical, cytopathology, or histopathology laboratory. Surgical pathology examines organs, limbs, tumors, fetuses, and other tissues biopsied in surgery such as breast mastectomies."
          },
          {
            "code": "genetics",
            "display": "Laboratory that mainly performs DNA analysis."
          },
          {
            "code": "cytogenetics",
            "display": "Laboratory that uses blood and other cells to get a karyotype. This can be helpful in prenatal diagnosis (e.g. Down's syndrome) as well as in cancer (some cancers have abnormal chromosomes)."
          }
        ]
      }
    ]
  }
}